import { Table, TableCard } from "components/common";

const TasksList = () => {
  return (
    <TableCard>
      <Table
        columns={[
          {
            width: 220,
            title: "IFO",
            dataIndex: "ifo",
          },
          {
            width: 220,
            title:
              "Хизматга чиққан кун / Патруллик йўналишида хизмат олиб борилган кун",
            dataIndex: "date",
          },
          {
            width: 100,
            title: "1.1",
            dataIndex: "1_1",
          },
          {
            width: 100,
            title: "1.2",
            dataIndex: "1_2_1",
          },
          {
            width: 100,
            title: "1.2.2",
            dataIndex: "1_2_2",
          },
          {
            width: 100,
            title: "1.3",
            dataIndex: "1_3",
          },
          {
            width: 100,
            title: "1.4",
            dataIndex: "1_4",
          },
          {
            width: 100,
            title: "1.5",
            dataIndex: "1_5",
          },
        ]}
        dataSource={[
          {
            ifo: "1-гр. ком. Ж.Ахранов",
            date: "31 / 28",
            "1_1": "20,0 / 28",
            "1_2_1": "20,0 / 28",
            "1_2_2": "20,0 / 28",
            "1_3": "20,0 / 28",
            "1_4": "20,0 / 28",
            "1_5": "20,0 / 28",
          },
          {
            ifo: "1-гр. ком. Ж.Ахранов",
            date: "31 / 28",
            "1_1": "20,0 / 28",
            "1_2_1": "20,0 / 28",
            "1_2_2": "20,0 / 28",
            "1_3": "20,0 / 28",
            "1_4": "20,0 / 28",
            "1_5": "20,0 / 28",
          },
          {
            ifo: "1-гр. ком. Ж.Ахранов",
            date: "31 / 28",
            "1_1": "20,0 / 28",
            "1_2_1": "20,0 / 28",
            "1_2_2": "20,0 / 28",
            "1_3": "20,0 / 28",
            "1_4": "20,0 / 28",
            "1_5": "20,0 / 28",
          },
          {
            ifo: "1-гр. ком. Ж.Ахранов",
            date: "31 / 28",
            "1_1": "20,0 / 28",
            "1_2_1": "20,0 / 28",
            "1_2_2": "20,0 / 28",
            "1_3": "20,0 / 28",
            "1_4": "20,0 / 28",
            "1_5": "20,0 / 28",
          },
        ]}
      />
    </TableCard>
  );
};

export default TasksList;
